Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/projects-omegat.tmx
Source language: en_us
Languages: pt_br

source: Task List
pt_br: Lista de tarefas

source: Enables the Task List window to scan for tasks in the main project or all opened projects.
pt_br: Habilite a janela lista de tarefas para procurar por tarefas no projeto principal ou em todos os projetos abertos.

source: Task List - Project Integration
pt_br: Lista de tarefas - Integração de projeto

source: Main Project
pt_br: Projeto principal

source: Show tasks for the main project and for the opened projects on which it depends
pt_br: Exibe as tarefas para o projeto principal e para os projetos abertos que estão em dependencia

source: Opened Projects
pt_br: Projetos abertos

source: Show tasks for all opened projects
pt_br: Exibe tarefas para todos os projetos abertos

source: Integrates the Task List window with Projects system
pt_br: Integra a janela lista de tarefas com o sistema do projeto

source: Library Manager
pt_br: Gerenciador de bibliotecas

source: The library provider has thrown the following exception during library initialization, the created library may not work correctly.
pt_br: O provedor de bibliotecas lançou a seguinte exceção durante a inicialização da biblioteca, a biblioteca criada pode não funcionar corretamente.

source: The library provider has thrown the following exception during library removal.
pt_br: O provedor de bibliotecas lançou a seguinte exceção durante a remoção da biblioteca.

source: External Libraries
pt_br: Bibliotecas externas

source: Infrastructure
pt_br: Infra-estrutura

source: Support for organizing resources into libraries.
pt_br: Suporte para organizar de recursos dentro de bibliotecas.

source: The Libraries module enables you to create, manage and use libraries in your project.
pt_br: O módulo bibliotecas permite criar, gerenciar e usar bibliotecas em seu projeto.

source: It is useful if you share external resources among several projects.
pt_br: Isto é útil se você compartilha recursos externos entre vários projetos.

source: &New Library...
pt_br: &Nova biblioteca...

source: &Remove
pt_br: &Remover

source: Library &Name:
pt_br: &Nome da biblioteca:

source: Library &Type:
pt_br: &Tipo da biblioteca:

source: Li&brary Name:
pt_br: Nome da bi&blioteca:

source: New Library
pt_br: Nova biblioteca

source: MyLibrary
pt_br: Minha biblioteca

source: Library {0} already exists.
pt_br: A biblioteca {0} já existe.

source: The library name is not valid.
pt_br: O nome da biblioteca não é válido.

source: The library name contains invalid characters
pt_br: O nome da biblioteca contém caracteres inválidos

source: &Libraries
pt_br: Bib&liotecas

source: Libraries manager lets you create, modify and delete libraries in the library repository.
pt_br: O gerenciador de bibliotecas permite criar, modificar e excluir bibliotecas no repositório de bibliotecas.

source: Properties
pt_br: Propriedades

source: &Libraries:
pt_br: Bib&liotecas:

source: Project UI
pt_br: UI de projetos

source: Supplies the basic user interface for projects in the IDE.
pt_br: Prove a interface de usuário básica para projetos na IDE.

source: GUI infrastructure for working with projects in the IDE: the Projects and Files tabs, the project chooser dialog, the project-sensitive New File wizard, etc.
pt_br: Infra-estrutura GUI para trabalho com projetos na IDE: abas de projetos e arquivos, diálogos para escolher o projeto, assistente de novo arquivo para projetos, etc.

source: Project XML Schemas
pt_br: Esquemas XML do projeto

source: Permits validation of project.xml and private.xml files from the IDE.
pt_br: Permite a validação dos arquivos project.xml e private.xml para o IDE.

source: &Select Folder
pt_br: &Selecionar pasta

source: Cancel
pt_br: Cancelar

source: Select Folder
pt_br: Selecionar pasta

source: &Folders:
pt_br: &Pastas:

source: Browse Folders
pt_br: Pesquisar pastas

source: Files
pt_br: Arquivos

source: Projects
pt_br: Projetos

source: Projects - {0}
pt_br: Projetos - {0}

source: &Files
pt_br: &Arquivos

source: Pro&jects
pt_br: Pro&jetos

source: {0} [Main]
pt_br: {0} [Principal]

source: Open Project
pt_br: Abrir projeto

source: Opens the project located in the selected folder.
pt_br: Abre o projeto localizado na pasta selecionada.

source: Project Folder
pt_br: Pasta de projetos

source: &Project Name:
pt_br: &Nome do projeto:

source: Open as &Main Project
pt_br: Abrir como projeto &principal

source: Open &Required Projects:
pt_br: Abrir projetos &requeridos:

source: Please wait ...
pt_br: Aguarde ...

source: {0} Projects
pt_br: {0} projetos

source: <unrecognized project; missing plug-in?>
pt_br: <projeto desconhecido; faltando plug-in?>

source: New
pt_br: Novo

source: Folder/File...
pt_br: Arquivo/Pasta...

source: Open
pt_br: Abrir

source: Project...
pt_br: Projeto...

source: &Build
pt_br: C&onstruir

source: &Run
pt_br: Executa&r

source: Ru&n File
pt_br: E&xecutar Arquivo

source: This Computer
pt_br: Este computador

source: Project
pt_br: Projeto

source: Build
pt_br: Construir

source: Projects with Existing Sources
pt_br: Projeto com código-fonte existente

source: Samples
pt_br: Exemplos

source: Licenses
pt_br: Licença

source: Default License
pt_br: Licença padrão

source: Project in {0}
pt_br: Projeto em {0}

source: Source folder in {0}
pt_br: Pasta de código-fonte em {0}

source: The main project has not been set.
pt_br: O projeto principal não foi definido.

source: &Select the main project:
pt_br: &Selecione o projeto principal:

source: Warning
pt_br: Aviso

source: Infinite Progress Bar
pt_br: Barra de progresso indeterminado

source: Shows some tasks are in progress.
pt_br: Mostra algumas tarefas em execução.

source: Save
pt_br: Salvar

source: &Save
pt_br: &Salvar

source: Save.
pt_br: Salvar.

source: Save &All
pt_br: S&alvar todos

source: Save all.
pt_br: Salvar todos.

source: &Discard All
pt_br: &Descartar todos

source: Discard all.
pt_br: Descartar todos.

source: An exception occurred while saving
pt_br: Ocorreu uma exceção ao salvar

source: List
pt_br: Lista

source: List of changed files for save
pt_br: Lista de arquivos alterados para salvar

source: Dialog for save any changes
pt_br: Diálogo para salvar algumas alterações

source: Select Project
pt_br: Selecionar projeto

source: &Categories:
pt_br: &Categorias:

source: &Projects:
pt_br: &Projetos:

source: &File Types:
pt_br: Tipos de &arquivos:

source: &Description:
pt_br: &Descrição:

source: Choose File Type
pt_br: Escolher tipo de arquivo

source: &Project:
pt_br: &Projeto:

source: File types:
pt_br: Tipos de arquivos:

source: Description:
pt_br: Descrição:

source: No description
pt_br: Sem descrição

source: Only Show File Types Supported in Selected Project
pt_br: Mostra apenas tipos de arquivo suportados no projeto selecionado

source: File &Name:
pt_br: &Nome do arquivo:

source: Folder &Name:
pt_br: &Nome da pasta:

source: Fo&lder:
pt_br: Pas&ta:

source: Pa&rent Folder:
pt_br: Pasta pa&i:

source: Bro&wse...
pt_br: Proc&urar...

source: &Created File:
pt_br: Arquivo &criado:

source: &Created Folder:
pt_br: Pasta &criada

source: Loca&tion:
pt_br: Locali&zação:

source: New File
pt_br: Novo arquivo

source: New file wizard
pt_br: Novo assistente de arquivos

source: Choose new file type
pt_br: Escolher novo tipo de arquivo

source: New Project
pt_br: Novo projeto

source: New project wizard
pt_br: Novo assistente de projeto

source: Choose type of new project
pt_br: Escolher o tipo do novo projeto

source: Choose Project
pt_br: Escolher projeto

source: Please wait...
pt_br: Aguarde...

source: Folder
pt_br: Pasta

source: &File Name:
pt_br: Nome do &arquivo:

source: New Empty File
pt_br: Novo arquivo vazio

source: &Folder Name:
pt_br: Nome da &pasta

source: New Folder
pt_br: Nova pasta

source: File Name to Create
pt_br: Nome do arquivo a criar

source: Folder Name to Create
pt_br: Nome da pasta a criar

source: &Templates:
pt_br: &Modelos:

source: Name and Location
pt_br: Nome e localização

source: new
pt_br: novo

source: The target folder does not exist.
pt_br: A pasta de destino não existe.

source: The target folder is read-only.
pt_br: A pasta de destino é somente-leitura.

source: The file {0} already exists.
pt_br: O arquivo {0} já existe.

source: The document node could not be found in the Projects tab.
pt_br: O documento indicado não pôde ser encontrado na aba projetos.

source: The document node could not be found in the Files tab.
pt_br: O documento indicado não pode ser encontrado na aba arquivos.

source: Multiple Projects
pt_br: Múltiplos projetos

source: No main project
pt_br: Nenhum projeto principal

source: Categories of types new objects
pt_br: Categorias para novos tipos de objetos

source: List of categories of new objects which can be choosen
pt_br: Lista de categorias de novos objetos que podem ser escolhidos

source: Types of new objects
pt_br: Tipos de novos objetos

source: List of types of new objects which can be choosen
pt_br: Lista de tipos de novos objetos que podem ser escolhidos

source: List of available projects
pt_br: Lista de projetos disponíveis

source: Folders:
pt_br: Pastas:

source: The tree contains the folders contained in the project's directory
pt_br: A árvore contém as pastas do projeto

source: Browse folders to choose a target folder
pt_br: Explorar as pastas para escolher a pasta de destino

source: Opens also the projects of which depends the selected project
pt_br: Também abrir os projetos dos quais depende o projeto selecionado

source: List of the subprojects
pt_br: Lista de sub-projetos

source: List of the projects of which depends the selected project
pt_br: Lista de projetos dos quais depende o projeto selecionado

source: The filename {0} is not permitted as it contains {1,choice,0#a slash (/) or a backslash (\)|1#a backslash (\)}.
pt_br: O nome do arquivo {0} não é permitido pois contém {1,choice,0#uma barra (/) ou uma barra invertida(\)|1#uma barra invertida (\)}.

source: The folder name {0} is not permitted as it contains {1,choice,0#a slash (/) or a backslash (\)|1#a backslash (\)}.
pt_br: O nome da pasta {0} não é permitido pois contém {1,choice,0#uma barra (/) ou uma barra invertida (\)|1#uma barra invertida (\)}.

source: Opening Projects
pt_br: Abrindo projetos

source: Opening Project:
pt_br: Abrindo projeto:

source: Cannot create folder: {0}
pt_br: Não foi possível criar a pasta: {0}

source: Select Document in
pt_br: Selecionar documento em

source: <html>Do you want to open project <b>{0}</b>?
pt_br: <html>Deseja abrir o projeto <b>{0}</b>?

source: Confirm Open Project
pt_br: Confirmar abertura de projeto

source: Opening {2} {1} Projects
pt_br: Abrindo projetos {2} {1}

source: Closing {2} {1} Projects
pt_br: Fechando projetos {2} {1}

source: Initializing {2} {1} Projects
pt_br: Inicializando projetos {2} {1}

source: All NetBeans Projects specific templates, you can find here templates of particular types of projects.
pt_br: Todos os modelos específicos de projetos NetBeans, você pode localizar aqui modelos de tipos particulares de projetos.

source: Import of Existing Projects.
pt_br: Importação de projetos existentes.

source: Creates a new folder on your disk.
pt_br: Cria uma nova pasta em seu disco.

source: Ne&w Project...
pt_br: No&vo projeto...

source: New Project...
pt_br: Novo projeto...

source: &New File...
pt_br: &Novo arquivo...

source: New File...
pt_br: Novo arquivo...

source: Other...
pt_br: Outro...

source: Open Proj&ect...
pt_br: Abrir proj&eto...

source: Open Project...
pt_br: Abrir projeto...

source: Open Required Projects
pt_br: Abrir projetos requeridos

source: &Close {0,choice,0#Project|1#"{1}"|1<{0} Projects}
pt_br: Fe&char {0,choice,0#Projeto|1#"{1}"|1<{0} Projetos}

source: Close {0,choice,0#|1#|1<{0} Projects}
pt_br: Fechar {0,choice,0#|1#|1<{0} Projetos}

source: {0,choice,0#Project|1#"{1}"|1<Project} Proper&ties
pt_br: Proprie&dades do {0,choice,0#projeto|1#"{1}"|1<projeto}

source: Open Recent Project
pt_br: Abrir projeto recente

source: Save Project
pt_br: Salvar projeto

source: Set as Main Project
pt_br: Definir como projeto principal

source: Select Node in Projects
pt_br: Selecionar nó em projetos

source: Select Node in Files
pt_br: Selecionar nó em arquivos

source: Select in Projects
pt_br: Selecionar em Projetos

source: Select in Files
pt_br: Selecionar em Arquivos

source: Build {0,choice,0#Project|1#"{1}" Project|1<{0} Projects}
pt_br: Construir {0,choice,0#Projeto|1#"{1}" Projeto|1<{0} Projetos}

source: Clean {0,choice,0#Project|1#"{1}" Project|1<{0} Projects}
pt_br: Limpar {0,choice,0#Projeto|1#"{1}" Projeto|1<{0} Projetos}

source: Clean and Build {0,choice,0#Project|1#"{1}" Project|1<{0} Projects}
pt_br: Limpar e construir {0,choice,0#projeto|1#"{1}" projeto|1<{0} projetos}

source: &Generate Javadoc for {0,choice,0#Project|1#"{1}"|1<{0} Projects}
pt_br: &Gerar javadoc para o {0,choice,0#projeto|1#"{1}"|1<{0} projetos}

source: Test {0,choice,0#Project|1#"{1}"|1<{0} Projects}
pt_br: Testar {0,choice,0#projeto|1#"{1}"|1<{0} projetos}

source: Co&mpile {0,choice,0#File|1#"{1}"|1<Files}
pt_br: Co&mpilar {0,choice,0#arquivo|1#"{1}"|1<arquivos}

source: &Stop Building
pt_br: Parar con&strução

source: Delete
pt_br: Excluir

source: Copy...
pt_br: Copiar...

source: Move...
pt_br: Mover...

source: Rename...
pt_br: Renomear...

source: Run {0,choice,0#Project|1#"{1}" Project|1<{0} Projects}
pt_br: Executar {0,choice,0#projeto|1#"{1}" projeto|1<{0} projetos}

source: &Build Main Project
pt_br: C&onstruir projeto principal

source: Clean Main Project
pt_br: Limpar projeto principal

source: &Clean and Build Main Project
pt_br: Limpar e c&onstruir projeto principal

source: &Run Main Project
pt_br: Executa&r projeto principal

source: Set Main Project
pt_br: Definir como projeto principal

source: &Run {0,choice,0#File|1#"{1}"|1<Files}
pt_br: Executa&r {0,choice,0#arquivo|1#"{1}"|1<arquivos}

source: &Test {0,choice,0#File|1#"{1}"|1<Files}
pt_br: &Testar {0,choice,0#arquivo|1#"{1}"|1<arquivos}

source: Directory does not contain any project.
pt_br: Diretório não contém nenhum projeto.

source: Open Project of Folder
pt_br: Abrir pasta do projeto

source: Open Project "{0}"
pt_br: Abrir projeto "{0}"

source: Open {0} Projects
pt_br: Abrir {0} projetos

source: Set Main Project Con&figuration
pt_br: Definir como con&figuração principal do projeto

source: Set Configuration
pt_br: Definir configuração

source: &Customize...
pt_br: &Personalizar...

source: Invoking {4} implemented as {3} thru {1}
pt_br: Invocando {4} implementado como {3} através {1}

source: Please save project's modified files before configuring project properties.
pt_br: Por favor, salve os arquivos modificados do projeto antes de configurar as propriedades do projeto.

source: Save All
pt_br: Salvar todos

source: Save modified files
pt_br: Salvar arquivos modificados

source: &Free Group
pt_br: &Grupo livre

source: Contains any projects you like.
pt_br: Contém alguns projetos favoritos.

source: Can be updated manually or automatically.
pt_br: Pode ser atualizado manualmente ou automaticamente.

source: &Use Currently Open Projects
pt_br: &Usar projetos atualmente abertos

source: &Automatically Save Project List
pt_br: Salvar &automaticamente a lista de projetos

source: Project and All &Required Projects
pt_br: Projeto e todos os projetos &requeridos

source: Contains a master project and all projects it requires, recursively.
pt_br: Contém um projeto mestre e todos os projetos que ele requer, recursivamente.

source: &Master Project:
pt_br: Projeto &mestre:

source: &Browse...
pt_br: &Procurar...

source: F&older of Projects
pt_br: Pasta de pr&ojetos

source: Contains any projects found beneath a given folder on disk.
pt_br: Contém alguns projetos encontrados em uma pasta no disco.

source: Fol&der:
pt_br: Pas&ta:

source: &Name:
pt_br: &Nome:

source: Project Gro&up
pt_br: Gr&upo de projetos

source: (none)
pt_br: (nenhum)

source: &New Group...
pt_br: &Novo grupo...

source: &Properties of "{0}"
pt_br: &Propriedades de "{0}"

source: Project Group Properties
pt_br: Propriedades do grupo de projetos

source: &Remove "{0}"
pt_br: &Remover "{0}"

source: Create New Group
pt_br: Criar novo grupo

source: Create Group
pt_br: Criar grupo

source: Selecting project group: {0}
pt_br: Selecionar grupo de projeto: {0}

source: Opening group "{0}"
pt_br: Abrindo grupo "{0}"

source: Closing group
pt_br: Fechando grupo

source: Closing {0} old projects
pt_br: Fechando {0} projetos antigos

source: Opening {0} new projects
pt_br: Abrindo {0} novos projetos

source: Loading project "{0}"
pt_br: Lendo projeto "{0}"

source: &Save Current Project List Now
pt_br: &Salvar agora a lista de projetos atuais

source: &Folder:
pt_br: &Pasta:

source: Project API
pt_br: API de projetos

source: General API for accessing and loading IDE projects.
pt_br: API para acessar e carregar projetos de IDE.

source: The most abstract API for working with all kinds of projects.
pt_br: A API mais abstrada para trabalhar com todos os tipos de projetos.

source: Does not assume they have anything to do with either Ant or Java.
pt_br: Não assume que o projeto em questão trabalhe tanto com Ant ou mesmo Java.

source: Does not work with the GUI, only with the internal recognition and loading of projects, and some of their basic characteristics.
pt_br: Não trabalha com o GUI, somente com o reconhecimento interno e carregamento de projetos, e algumas de suas características básicas.

source: Project Properties
pt_br: Propriedades do projeto

source: Opens a dialog box where you can configure important project properties.
pt_br: Abre uma caixa de diálogo onde você pode configurar as propriedades importantes do projeto.

source: Properties Category
pt_br: Categoria de propriedades

source: Categories:
pt_br: Categorias:

source: Cleaning Project
pt_br: Limpando projeto

source: Deleting {0}
pt_br: Excluindo {0}

source: Project {0} cannot be deleted.
pt_br: O projeto {0} não pode ser excluido.

source: Delete Project
pt_br: Excluir projeto

source: Deleting Project:
pt_br: Excluindo projeto:

source: &Yes
pt_br: &Sim

source: No
pt_br: Não

source: Copy
pt_br: Copiar

source: Move
pt_br: Mover

source: Rename
pt_br: Renomear

source: Yes Button
pt_br: Botão sim

source: No Button
pt_br: Botão não

source: Cancel Button
pt_br: Botão cancelar

source: Copy Button
pt_br: Botão copiar

source: Move Button
pt_br: Botão mover

source: Rename Button
pt_br: Botão renomear

source: Cannot move project, reason: {0}
pt_br: Não é possível mover o projeto, motivo: {0}

source: Cannot copy project, reason: {0}
pt_br: Não é possível copiar o projeto, motivo: {0}

source: Cannot rename project, reason: {0}
pt_br: Não é possível renomear o projeto, motivo: {0}

source: Are you sure you want to delete project "{0}"?
pt_br: Você tem certeza que deseja excluir o projeto "{0}"?

source: &Also Delete Sources Under "{0}" folder.
pt_br: Excluir t&ambém os códigos-fonte da pasta "{0}".

source: Pre Delete Warning
pt_br: Aviso de pré-exclusão

source: Also Delete Sources Under "{0}" folder.
pt_br: Excluir também os códigos-fonte da pasta "{0}".

source: {0,choice,0#Copy|1#Move} "{1}" To:
pt_br: {0,choice,0#Copiar|1#Mover} "{1}" para:

source: Project Fol&der:
pt_br: Pasta &de projetos:

source: Project &Location:
pt_br: &Local do projeto:

source: Project &Name:
pt_br: &Nome do projeto:

source: {0,choice,0#Copying Project|1#Moving Project}
pt_br: {0,choice,0#Copiando projeto|1#Movendo projeto}

source: Br&owse
pt_br: Pr&ocurar

source: Browse Button
pt_br: Botão procurar

source: Project Location
pt_br: Local do projeto

source: Project Name
pt_br: Nome do projeto

source: Copy Project
pt_br: Copiar projeto

source: Copying Project
pt_br: Copiando projeto

source: Move Project
pt_br: Mover projeto

source: Moving Project
pt_br: Movendo projeto

source: The project has one or more external source roots and cannot be copied.
pt_br: O projeto tem uma ou mais fontes externa e não pode ser copiado.

source: Rename "{0}":
pt_br: Renomear "{0}":

source: &Also Rename Project Folder
pt_br: Renomear t&ambém a pasta do projeto

source: Renaming Project
pt_br: Renomeando projeto

source: Also Rename Project Folder
pt_br: Renomear também a pasta do projeto

source: Rename Project
pt_br: Renomear projeto

source: Project location does not exist.
pt_br: O local do projeto não existe.

source: Project folder already exists.
pt_br: A pasta do projeto já existe.

source: Project name must be entered.
pt_br: O nome do projeto deve ser informado.

source: Project location is read only.
pt_br: O local do projeto é somente leitura.

source: Project name "{0}" is not a valid filename.
pt_br: Nome do projeto "{0}" não é um nome de arquivo válido.

source: Project UI API
pt_br: API de UI de projetos

source: Supplies the APIs/SPIs for user interface of projects in the IDE.
pt_br: Fornece as APIs/SPIs para a interface de usuário de projetos no IDE.

source: Includes APIs and SPIs for working with the GUI behavior of projects.
pt_br: Inclui APIs e SPIs para trabalhar com os comportamentos GUI de projetos.

source: All implementation lives in the Projects UI module.
pt_br: Toda a implementação está no módulo UI de projetos.

source: General Queries API
pt_br: API de consultas gerais

source: Acts as a general communication channel between modules.
pt_br: Canal geral de comunicação entre os módulos.

source: Hosts queries which are not particularly domain-specific.
pt_br: Os servidores examinam o que não é particularidade de domínios específicos.

source: Permits different modules to obtain information about files in a flexible way.
pt_br: Permite a diferentes módulos obter informações sobre arquivos de maneira flexível.
